{
    "Best Pickup Lines": [
        "Do you have a name, or can I just call you 'mine'?",
        "Let’s flip a coin. Head, I’m yours. Tails, you’re mine.",
        "I seem to have lost my phone number. Can I have yours?",
        "You're so fine, you made me forget my pickup line.",
        "Did we go to school together? I could swear we had chemistry.",
        "Want a raisin? No? How about a date?",
        "What's your favorite drink? I'm asking, so I know what to buy you on our first date.",
        "Have we met? Because you look exactly like my next boyfriend/girlfriend/partner.",
        "I never believed in love at first sight, but that's before I saw you.",
        "You owe me a drink because when I saw you, I dropped mine.",
        "They say nothing lasts forever so will you be my nothing?",
        "Want to go outside for some fresh air? You took my breath away.",
        "I’m going to have to ask you to leave, you’re making everyone else in here look bad.",
        "I still get butterflies in my stomach when I think about you.",
        "Your eyes are like IKEA. I could get lost in them for hours.RELATED: Funny Science Jokes That'll Make You Laugh Harder Than Nitrous Oxide"
    ],
    "Funny Pickup Lines": [
        "Do you believe in love at first sight, or should I walk by again?",
        "I bought you a dictionary since you add so much meaning to my life.",
        "Let me tie your shoes. I don’t want you falling for anyone else.",
        "Are you a Wi-Fi signal? Because I'm feeling a strong connection here.",
        "If you were a taser, you’d be set to stun.",
        "How much does a polar bear weigh? Enough to break the ice! Hi, I’m [name].",
        "I bet your birthday is October 10 because you’re a 10/10.",
        "I need a real estate agent — do you know any? I’m trying to make a move here.",
        "Are you a time traveler? Because I see you in my future.",
        "I believe in following my dreams. Can I have your Instagram?",
        "Is your name Google? Because you're everything I've been searching for.",
        "Did your license get suspended for driving all those guys crazy?",
        "Do you have a Band-Aid? I scraped my knee falling for you.",
        "Let’s taco ‘bout how amazing you are over tacos and margaritas next week.",
        "What do you call a string of people lifting a mozzarella cheese? A cheesy pickup line.",
        "Do you play soccer? Because you look like a keeper.",
        "Whenever I meet someone new, I start talking about climate change. That’s usually enough to break the ice.RELATED: Funny Quotes Guaranteed to Make You Laugh"
    ],
    "Cheesy Pickup Lines": [
        "If you were a fruit, you'd be a \"fine-apple.\"",
        "I got you some new sneakers. I figured you’d need them after running through my mind so much.",
        "Are you my wisdom teeth? Because I have a feeling that I should take you out as soon as possible.",
        "Is your name Dunkin? Because I donut want to spend another day without you.",
        "We should go out for coffee sometime because I like you a latte.",
        "This might sound cheesy, but I think you’re really grate.",
        "Are you from Tennessee? Because you're the only 10 I see.",
        "Are your parents bakers? Because you're a cutie pie.",
        "If you and I were socks, we'd make a great pair.",
        "If I could rearrange the alphabet, I'd put U and I together.",
        "Well, here I am! What are your other two wishes?",
        "Are you a parking ticket? You've got fine written all over you.",
        "If you were a chicken, you'd be \"im-peck-able\"Woman's Day",
        "They say dating is a numbers game, so can I get yours?",
        "Know what's on the menu today? Me 'n u.",
        "Are you a loan? Because you've got my interest.",
        "If you were a vegetable, you'd be a cute-cumber.",
        "If you were a triangle, you'd be acute one.",
        "Are you a magician? Because when I look at you, everyone else disappears.",
        "Wow, I've been blinded by your beauty. I'll need your name and number for insurance purposes.",
        "If you were a potato, you’d be a sweet potato.",
        "Are you a model? [They say “no.”] Oh, when did you quit?RELATED: Math Jokes and Puns for Kids (and Everyone Else!)"
    ],
    "Cute Pickup Lines": [
        "If I were a cat, I'd spend all nine of my lives with you.",
        "Do you want some wine to go with this cheesy pickup line?",
        "Oh look, the cutie pie I ordered is here!",
        "I promise I won’t break your heart — I’ll just steal it.",
        "I thought this was a [restaurant/bar/etc.], but it must actually be a museum because you're a work of art.",
        "What is it like to be the most gorgeous person in this room?",
        "I don't know your name, but I'm sure it's just as beautiful as you are.",
        "I'm not a photographer, but I can definitely picture us together.",
        "Are you an electrician? Because you're lighting up my day.",
        "I'm not an organ donor, but I'm ready to give you my heart.",
        "Anyone who says Disneyland is the happiest place on earth has clearly never stood next to you.",
        "Are you a charger? Because I'm dying without you.",
        "I can see that you're gorgeous, but what else should I know about you?",
        "Are you as beautiful on the inside as you are on the outside?",
        "You've got everything I've been looking for, and trust me, I've been looking for a long time.",
        "Can I have your picture, so I can show Santa what I want for Christmas this year?",
        "On a scale of 1 to 10, you're a 9, and I'm the 1 you need.",
        "I'd never play hide and seek with you because someone like you is impossible to find.",
        "Do you know what the Little Mermaid and I have in common? We both want to be part of your world.",
        "Are you a camera? Because all I can do is smile when I see you.",
        "[On a dating app] We’re a match! The next step is to pick a wedding date, right?RELATED: Funny Christmas Jokes for Kids and Parents"
    ],
    "Flirty Pickup Lines": [
        "So when our grandkids ask how we met, what should we tell them?",
        "Do you have a sunburn, or are you just always this hot?",
        "It's a good thing I have my library card because I am totally checking you out.",
        "I think you might be lacking some Vitamin Me.",
        "Do you like my new sweater? It’s made of [boyfriend/girlfriend] material.",
        "I’m no mathematician, but I’m pretty good with numbers. You should give me yours and watch what I can do with it.",
        "I'm learning about important dates in history, wanna be one of them?",
        "Did you just come out of an oven? Because you're too hot to handle.Woman's Day",
        "If you let me borrow a kiss, I promise I'll give it right back.",
        "I was feeling a little off today, but you've turned me on again.",
        "Well, I was just trying to [have dinner/have a drink] but you're very distracting.",
        "Stop, drop, and roll because baby, you’re on fire.",
        "If I had a garden, I’d put my tulips and your tulips together.",
        "Did you do something to my eyes? I can't seem to take them off you.",
        "Let’s make a deal: I’ll cook you dinner if you cook me breakfast.",
        "Those are nice arms. Could I see how they would feel around me?",
        "Let’s make like fabric softener and Snuggle.RELATED: Funny Summer Puns That'll Have You Laughing All Sea-son"
    ],
    "Pickup Lines for Girls ": [
        "I think someone must have stolen the stars and put them in your eyes.",
        "Have we met before? You look a lot like the love of my life.",
        "Your hand looks heavy, can I hold it for you?",
        "Is your name Chamomile? Because you look like a hot-tea.",
        "Do you remember me? Oh, that’s right — we’ve only met in my dreams.",
        "You’re pretty and I’m cute. Wanna be pretty cute together?",
        "I saw you walking by and I just had to come say hello.",
        "Do you know what you'd look beautiful in? My arms.",
        "The sparkle in your eye is so bright, the sun and stars must be jealous.",
        "(At a bar or other public place) You see my friend over there? He/she/they want to know if you think I'm cute.",
        "I think I saw you on Spotify, as the hottest single of the year.",
        "I think there's something wrong with my phone. Your number's not in it.",
        "When I text you good morning tomorrow, what number should I text?",
        "What emoji should I put next to your name in my phone?",
        "Can I borrow your phone? I need to call God and tell him I’ve found his missing angel.",
        "(If you know they’ve seen 'Barbie') Would you like to be my long-term long-distance low-commitment casual girlfriend?"
    ],
    "Pickup Lines for Guys ": [
        "Did you invent the airplane? Because you're clearly Mr. Wright.",
        "If being handsome was a crime, you’d be guilty as charged.",
        "I think your number will be safer in my phone than in your head.",
        "I’m writing an article on the finer things in life. Can I interview you?",
        "Whoa, is there a firefighter around?! Because you’re smoking hot.",
        "Hi, my name is [your name], but you can call me tonight or tomorrow.",
        "Do you like Star Wars? Because Yoda only one for me.",
        "My friends bet me I couldn't chat up the hottest guy in the bar. Want to use their money to buy some more drinks?",
        "I believe in honesty, so let me be honest: you're the most attractive man I've ever seen.",
        "You must be a talented thief because you managed to steal my heart from all the way over here.",
        "I had a good pickup line ready to go, but you're so good-looking I'm speechless.",
        "I'm surprised they haven't asked you to leave yet. You're making all the other men in here look bad.",
        "Can we take a picture together? I want to show my mom what my next boyfriend looks like.",
        "I have a question and need a man/woman’s advice. [They say, “Okay, what’s up?] If I see a really cute guy/girl, should I just go talk to him/her or is that too direct? [They say, “You should talk to them!\"] Hi, I’m (your name)."
    ]
}